---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.AsInteger
source: html/ff1d8443-8329-cab4-6d4d-119bbe0b6e41.htm
---
# Autodesk.Revit.DB.IFC.IFCData.AsInteger Method

Gets storage value as integer when its PrimitiveType is integer.

## Syntax (C#)
```csharp
public int AsInteger()
```

## Returns
The int value.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - The primitive type is not integer.